---
kind: type
id: T:Autodesk.Revit.DB.MaterialPropertyPathType
source: html/38cbac37-6832-2aa2-1922-8bd6b4f2c377.htm
---
# Autodesk.Revit.DB.MaterialPropertyPathType

Enum class indicating kinds of paths which ExternalFileReferenceType.Material
 references can have.

## Syntax (C#)
```csharp
public enum MaterialPropertyPathType
```